---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.TransformModel
source: html/de9ef645-fadd-1ccc-f992-96f65c87c056.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModel.TransformModel Method

Transforms all surfaces in the model according to the document's active
 ground plane, shared coordinates and true north.

## Syntax (C#)
```csharp
public void TransformModel()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This operation failed.